# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

a = 10
b = 13.5
c = 'переменная'

print('a: ', a, 'b: ', b, 'c: ',c)
d =input('Введите D:')
print ('D:', d)
